# ДОМАШНЕЕ ЗАДАНИЕ 0. Разработка MapReduce приложений

С.Ю. Папулин (papulin.study@yandex.ru)

### Содержание

- [Задание 1. Расчет среднего рейтинга](#Задание-1.-Расчет-среднего-рейтинга)
- [Задание 2. Добавление наименования товара](#Задание-2.-Добавление-наименования-товара)
- [Задание 3. Поиск среднего рейтинга по названию товара](#Задание-3.-Поиск-среднего-рейтинга-по-названию-товара)


Чтобы узнать свой вариант, запустите `python` код с указанием Вашей фамилии:

```python
surname = "Иванов" #Ваша фамилия

alp = 'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'
w = [4, 42, 21, 21, 34,  1, 44, 26, 18, 43, 38, 26, 18, 43,  3, 49, 45,
        7, 42, 25,  4,  9, 36, 33, 31, 29,  5, 31,  4, 19, 24, 27, 33]
d = dict(zip(alp, w))
variant =  sum([d[el] for el in surname.lower()]) % 2 + 1
print("Ваш вариант - ", variant)
```

**Вариант 1:**
- Размер блоков: 64MB, 128MB, 256MB
- Количество рабочих узлов: 3
- Типы инстансов: `m4.xlarge`

**Вариант 2:**
- Размер блоков: 64MB
- Количество рабочих узлов: 1, 3, 5
- Типы инстансов: `m4.xlarge`

**Вариант 3:**
- Размер блоков: 64MB
- Количество рабочих узлов: 3
- Типы инстансов: `m4.large`, `m4.xlarge`, `m3.2xlarge`

ℹ️ Последовательность действий:
- Создайте проект в `IntellJL`
- Добавьте необходимые модули для работы с `Hadoop`
- Напишите код
- Запустите код локально на небольшом наборе данных. Убедитесь, что всё работает правильно
- Создайте `jar` файлы
- Запустите кластер `AWS EMR`
- Загрузите данные в `HDFS` (3 реплики) кластера и `jar` файлы на узел мастера
- Запустите программы и сохраните результат в `HDFS`
- Запишите время выполнения программы
- Выведите часть результата на экран
- Подключитесь к веб-панели `ResourceManager`'а и сделайте скриншоты параметров выполненных приложений


## Задание 1. Расчет среднего рейтинга

Набор данных отзывов:
- [описание](http://jmcauley.ucsd.edu/data/amazon/links.html)
- [выборка из 100 отзывов](../data/sample_100.json)
- [полный набор данных](http://snap.stanford.edu/data/amazon/productGraph/categoryFiles/reviews_Electronics_5.json.gz)

Реализуйте подсчет среднего рейтинга товара. Результат сохранить в `HDFS`. Формат каждой записи `CSV`: `ProdId,Rating`

## Задание 2. Добавление наименования товара

Набор данных наименований товаров:
- [выборка мета-данных товаров](../data/sample_100_meta.json)
- [полный набор мета-данных](http://snap.stanford.edu/data/amazon/productGraph/categoryFiles/meta_Electronics.json.gz)

Напишите программу, которая каждому `ProdId` из задания 1 ставит в соответствие наименование товара. Результат сохранить в `HDFS` в `CSV` формате: `ProdId,Name,Rating`

## Задание 3. Поиск среднего рейтинга по названию товара

Напишите программу, которая выводит средний рейтинги всех товаров из задания 2, в названии которых встречается введенное при запуске слово: `ProdId,Name,Rating`

⚠️ **Замечание**:
Ссылки, в соответствии с правилами использования наборов данных:
- R. He, J. McAuley. Modeling the visual evolution of fashion trends with one-class collaborative filtering. WWW, 2016
- J. McAuley, C. Targett, J. Shi, A. van den Hengel. Image-based recommendations on styles and substitutes. SIGIR, 2015
